//script.js

// 1. Завдання з селекторами:
// Зміна тексту всіх елементів <p> на "Змінений текст"
$("p").text("Змінений текст");

// Додавання класу "highlight" елементу з ідентифікатором task1
$("#task1").addClass("highlight");

// Додавання класу list-item всім елементам <li>
$("li").addClass("list-item");

// 2. Завдання зі змінами стилів:
// Зміна кольору тексту всіх елементів з класу highlight на червоний
$(".highlight").css("color", "red");

// Зміна фону всіх елементів з класом list-item на світло-сірий.
$(".list-item").css("background-color", "#9fa6b3");

// 3. Завдання з анімацією:
// Анімаційний ефект для елементів з класом highlight
$(".highlight").element.fadeOut("speed").delay(3000).fadeIn("speed");

// 4. Завдання на зміну вмісту:
// Зміна тексту останнього елемента <p> у блоку з ідентифікатором task1 на "Новий останній текст"
$("#task1 p:last").text("Новий останній текст");

// 5. Додаткове завдання:
// Створення кнопки на сторінці
$("body").append("<button id="deleteButton">Видалити елементи</button>");
$("#deleteButton").on("click", function()
	{$("list-item").remove()
});